var locations = {
    "status": "ok",
    "data": [
        {
            "lat": 7.884488,
            "lon": 98.391283,
            "uid": 1827,
            "aqi": "38",
            "station": {
                "name": "Municipal Health Center 1, Phuket, Thailand (ศูนย์บริการสาธารณสุข 1 กองการแพทย์ เทศบาลนครภูเก็ต)",
                "time": "2024-10-17T14:00:00+09:00"
            }
        },
        {
            "lat": 7.881656,
            "lon": 98.427484,
            "uid": -421513,
            "aqi": "38",
            "station": {
                "name": "โรงเรียนเกาะสิเหร่ ภูเก็ต",
                "time": "2024-10-17T15:49:36+09:00"
            }
        },
        {
            "lat": 7.77355528011,
            "lon": 98.32379579544,
            "uid": -501961,
            "aqi": "5",
            "station": {
                "name": "Wiset Road ภูเก็ต",
                "time": "2024-10-17T15:50:01+09:00"
            }
        },
        {
            "lat": 7.874404,
            "lon": 98.38117,
            "uid": -421441,
            "aqi": "21",
            "station": {
                "name": "ศาลากลางจังหวัดภูเก็ต",
                "time": "2024-10-17T15:49:18+09:00"
            }
        },
        {
            "lat": 7.864091,
            "lon": 98.395452,
            "uid": -419524,
            "aqi": "38",
            "station": {
                "name": "ศูนย์กำจัดขยะมูลฝอยเทศบาลนครภูเก็ต",
                "time": "2024-10-17T15:45:51+09:00"
            }
        },
        {
            "lat": 7.982461,
            "lon": 98.362088,
            "uid": -419716,
            "aqi": "38",
            "station": {
                "name": "เชลล์ อ.ถลาง (อนุภาษและบุตร สาขา 3) ภูเก็ต",
                "time": "2024-10-17T15:47:19+09:00"
            }
        },
        {
            "lat": 8.514886535,
            "lon": 98.63900172,
            "uid": -248245,
            "aqi": "4",
            "station": {
                "name": "สสอ.ทับปุด ต.ทับปุด อ.ทับปุด จ.พังงา",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 8.696846119,
            "lon": 98.40873346,
            "uid": -248212,
            "aqi": "4",
            "station": {
                "name": "สสอ.กะปง ต.ท่านา อ.กะปง จ.พังงา",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 9.193689615,
            "lon": 98.41504086,
            "uid": -248218,
            "aqi": "4",
            "station": {
                "name": "สสอ.คุระบุรี ต.คุระ อ.คุระบุรี จ.พังงา",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 8.393412,
            "lon": 98.449843,
            "uid": -487729,
            "aqi": "29",
            "station": {
                "name": "สำนักงานสาธารณสุขอำเภอตะกั่วทุ่ง จ.พังงา",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 8.44028847,
            "lon": 98.51944445,
            "uid": -248335,
            "aqi": "21",
            "station": {
                "name": "สสจ.พังงา ต.ท้ายช้าง อ.เมือง จ.พังงา",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 8.444359,
            "lon": 98.529549,
            "uid": -419521,
            "aqi": "38",
            "station": {
                "name": "สำนักงานพลังงานจังหวัดพังงา",
                "time": "2024-10-17T15:49:11+09:00"
            }
        },
        {
            "lat": 8.035903,
            "lon": 98.81809,
            "uid": -419407,
            "aqi": "38",
            "station": {
                "name": "โรงแรมกระบี่รีสอร์ท",
                "time": "2024-10-17T15:13:12+09:00"
            }
        },
        {
            "lat": 8.2567078,
            "lon": 99.0465155,
            "uid": -346213,
            "aqi": "54",
            "station": {
                "name": "รพ.เขาพนม ต.เขาพนม อ.เขาพนม จ.กระบี่",
                "time": "2024-10-17T14:00:00+09:00"
            }
        },
        {
            "lat": 8.118696,
            "lon": 98.864539,
            "uid": -419488,
            "aqi": "38",
            "station": {
                "name": "โรงไฟฟ้าพลังงานขยะเทศบาลเมืองกระบี่",
                "time": "2024-10-17T15:47:48+09:00"
            }
        },
        {
            "lat": 8.10759,
            "lon": 98.91495,
            "uid": -419461,
            "aqi": "21",
            "station": {
                "name": "โรงเรียนเมืองกระบี่",
                "time": "2024-10-17T15:26:42+09:00"
            }
        },
        {
            "lat": 8.532798285,
            "lon": 98.86526106,
            "uid": -252187,
            "aqi": "4",
            "station": {
                "name": "รพ.ปลายพระยา ต.ปลายพระยา อ.ปลายพระยา จ.กระบี่",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.952121,
            "lon": 99.144181,
            "uid": -249082,
            "aqi": "4",
            "station": {
                "name": "รพ.คลองท่อม ต.คลองท่อมใต้ อ.คลองท่อม จ.กระบี่",
                "time": "2024-10-17T14:00:00+09:00"
            }
        },
        {
            "lat": 7.41271265234637,
            "lon": 99.5160027243051,
            "uid": -195730,
            "aqi": "21",
            "station": {
                "name": "ถนนเทศบาล 1  ต.กันตัง อ.กันตัง จ.ตรัง",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.40715281978095,
            "lon": 99.5152371819757,
            "uid": -94336,
            "aqi": "8",
            "station": {
                "name": "ทม.กันตัง ต.กันตัง อ.กันตัง จ.ตรัง",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.6395029,
            "lon": 99.5893006,
            "uid": -492469,
            "aqi": "13",
            "station": {
                "name": "รพ.สต.นาท่ามเหนือ ต.นาท่ามเหนือ อ.เมือง จ.ตรัง",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.520097,
            "lon": 99.633554,
            "uid": -419671,
            "aqi": "38",
            "station": {
                "name": "สำนักงานพลังงานจังหวัดตรัง",
                "time": "2024-10-17T15:55:19+09:00"
            }
        },
        {
            "lat": 7.556307,
            "lon": 99.43902,
            "uid": -419668,
            "aqi": "38",
            "station": {
                "name": "ตรังน้ำมันปาล์ม",
                "time": "2024-10-17T15:55:06+09:00"
            }
        },
        {
            "lat": 7.7041128,
            "lon": 99.3177051,
            "uid": -492463,
            "aqi": "8",
            "station": {
                "name": "อบต.กะลาเส ต.กะลาเส อ.สิเกา จ.ตรัง",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.570238,
            "lon": 99.588743,
            "uid": 13628,
            "aqi": "30",
            "station": {
                "name": "Polytechnic College, Trang, Thailand (วิทยาลัยสารพัดช่างตรัง)",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.55541,
            "lon": 99.60989,
            "uid": -482482,
            "aqi": "25",
            "station": {
                "name": "ศูนย์บริการสาธารณสุข 1 เทศบาลนครตรัง ต.ทับเที่ยง อ.เมือง จ.ตรัง",
                "time": "2024-10-17T15:00:00+09:00"
            }
        },
        {
            "lat": 7.50711,
            "lon": 99.663949,
            "uid": -196321,
            "aqi": "25",
            "station": {
                "name": "รพ.สต.บ้านควน ต.บ้านควน อ.เมืองตรัง จ.ตรัง (กอ.รมน.ตรัง)",
                "time": "2024-10-17T14:00:00+09:00"
            }
        },
        {
            "lat": 6.67152078319291,
            "lon": 99.8628355539766,
            "uid": -493219,
            "aqi": "4",
            "station": {
                "name": "รพ.สต.เกาะสาหร่าย ต.เจะบิลัง อ.เมือง จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 6.707929,
            "lon": 99.864909,
            "uid": -493222,
            "aqi": "4",
            "station": {
                "name": "รพ.สต.บ้านตันหยงกลิง  อ.เมือง จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 6.788325,
            "lon": 99.970534,
            "uid": -492313,
            "aqi": "4",
            "station": {
                "name": "แผนกผู้ป่วยนอก  รพ.ท่าแพ  อ.ท่าแพ จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 6.865967,
            "lon": 99.75898,
            "uid": -492457,
            "aqi": "8",
            "station": {
                "name": "อาคารผู้ป่วยนอก (OPD) โรงพยาบาลควนกาหลง  ต.ควนกาหลง อ.ควนกาหลง จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 6.931062,
            "lon": 99.78541,
            "uid": -487720,
            "aqi": "4",
            "station": {
                "name": "ห้อง OPD โรงพยาบาลละงู ต.กำแพง อ.ละงู จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 7.092722,
            "lon": 99.766083,
            "uid": -492472,
            "aqi": "4",
            "station": {
                "name": "อาคารผู้ป่วยใน (IPD) รพ.ทุ่งหว้า อ.ทุ่งหว้า จ.สตูล",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 6.624747,
            "lon": 100.066159,
            "uid": 10482,
            "aqi": "29",
            "station": {
                "name": "Phiman, Satun, Satun, Thailand (ต.พิมาน อ.เมือง จ.สตูล)",
                "time": "2024-10-17T16:00:00+09:00"
            }
        },
        {
            "lat": 9.95677,
            "lon": 98.639105,
            "uid": -419734,
            "aqi": "38",
            "station": {
              "name": "ร้านจ่าจ้า คอฟฟี่ ระนอง",
              "time": "2024-10-17T15:49:15+09:00"
            }
          },
          {
            "lat": 9.789044852,
            "lon": 98.77737019,
            "uid": -250252,
            "aqi": "4",
            "station": {
              "name": "รพ.พะโต๊ะ จ.ชุมพร",
              "time": "2024-10-17T15:00:00+09:00"
            }
          },
          {
            "lat": 9.779779,
            "lon": 98.594399,
            "uid": -138613,
            "aqi": "4",
            "station": {
              "name": "อาคารร้อยอาวุธเบาที่ 2 ร.25 พัน.2 จ.ระนอง (กอ.รมน.ภาค 4 สย.1)",
              "time": "2024-10-17T15:00:00+09:00"
            }
          },
          {
            "lat": 9.97745,
            "lon": 98.63628,
            "uid": -249634,
            "aqi": "8",
            "station": {
              "name": "สำนักงานสาธารณสุขอำเภอเมืองระนอง",
              "time": "2024-10-17T15:00:00+09:00"
            }
          },
          {
            "lat": 9.952081,
            "lon": 98.600103,
            "uid": -419548,
            "aqi": "38",
            "station": {
              "name": "สำนักงานตรวจคนเข้าเมือง จ.ระนอง",
              "time": "2024-10-17T15:46:17+09:00"
            }
          },
          {
            "lat": 9.895675,
            "lon": 98.622611,
            "uid": -419647,
            "aqi": "38",
            "station": {
              "name": "สำนักงานพลังงานจังหวัดระนอง",
              "time": "2024-10-17T15:45:13+09:00"
            }
          }
    ]
  };
  